app/controllers/v1/projects_controller.rb

INSERT INTO "projects" ("title", "description", "category", "plans", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @project = current_user.projects.new(project_params)

    authorize @project

    if @project.save

UPDATE "projects" SET "title" = $1, "description" = $2, "category" = $3, "updated_at" = $4 WHERE "projects"."id" = $5  [["title", "Covered and Warm"], ["description", "Est qui pariatur nostrum architecto quaerat debitis."], ["category", "Musiker"], ["updated_at", "2015-10-19 14:28:12.569458"], ["id", 5]]
---
  def update
    authorize @project

    if @project.update(project_params)

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 7]]
---
  def destroy
    authorize @project

    @project.destroy