app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    authorize @project

    if @project.save
---
INSERT INTO "projects" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "A Year of Walking"], ["description", "Ea rerum rerum minima optio explicabo."], ["created_at", "2015-10-06 09:09:33.674300"], ["updated_at", "2015-10-06 09:09:33.674300"]]

  def update
    authorize @project

    if @project.update(project_params)
---
UPDATE "projects" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["title", "Walking and Running"], ["description", "Et voluptas magni rerum sit autem."], ["updated_at", "2015-10-06 09:13:47.801189"], ["id", 5]]

  def destroy
    authorize @project

    @project.destroy
---
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 8]]